/*
//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
Console.Write ("Input two integers: ");
int num1 = Convert.ToInt32(Console.ReadLine());
int num2 = Convert.ToInt32(Console.ReadLine());
if (num1 > num2)
{
    Console.WriteLine ($"{num1} is bigger than {num2}");
}else {
    Console.WriteLine ($"{num2} is bigger than {num1}");
}
*/
/*
//Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
Console.Write("Input three integers: ");
int num1 = Convert.ToInt32(Console.ReadLine());
int num2 = Convert.ToInt32(Console.ReadLine());
int num3 = Convert.ToInt32(Console.ReadLine());
if (num1 > num2)
{
    if (num1 > num3)
    {
        Console.WriteLine($"The max of three integers is: {num1}");
    }
}
else
{
    if (num3 > num2)
    {
        Console.WriteLine($"The max of three integers is: {num3}");
    }
    else
    {
        Console.WriteLine($"The max of three integers is: {num2}");
    }
}
*/

//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
/*
Console.Write ("Input integer: ");
int num = Convert.ToInt32(Console.ReadLine());
if (num % 2 == 0)
{
    Console.WriteLine ($"{num} is even");
}else 
{
    Console.WriteLine ($"{num} is odd");
}
*/
/*
//Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
Console.Write("Input integer: ");
int num = Convert.ToInt32(Console.ReadLine());
for (int i = 1; i <= num; i++)
{
    if (i % 2 == 0)
    {
        Console.Write(i);
    }
}
*/