/*
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

int ShowSecondDigit (int numder)
{
    
    int result = (numder % 100)/10;
    return result;
}

Console.Write ("Input 3-digit integer: ");
int num = Convert.ToInt32(Console.ReadLine());
int secondDigit = ShowSecondDigit(num);
Console.Write ($" Second digit of number {num} is {secondDigit}");
*/

